In [10]:
%load_ext sql
%sql postgresql://reader:Miba2021@10.129.0.25:5432/demo

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%%sql
DROP TABLE IF EXISTS public.Department;

CREATE TABLE public.Department (
    DEPARTMENT_ID INT PRIMARY KEY,
    DEPARTMENT_NAME VARCHAR(50),
    MANAGER_ID INT
);

 * postgresql://reader:***@10.129.0.25:5432/demo
Done.
Done.

[]

In [14]:
%%sql
INSERT INTO Department (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID) VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205);

 * postgresql://reader:***@10.129.0.25:5432/demo
10 rows affected.

[]

In [15]:
%%sql
CREATE TABLE IF NOT EXISTS public.Employee (
    EMPLOYEE_ID INT PRIMARY KEY,
    FIRST_NAME VARCHAR(50),
    LAST_NAME VARCHAR(50),
    HIRE_DATE DATE,
    JOB_ID VARCHAR(10),
    MANAGER_ID INT,
    DEPARTMENT_ID INT,
    FOREIGN KEY (DEPARTMENT_ID) REFERENCES public.Departments(DEPARTMENT_ID)
);

 * postgresql://reader:***@10.129.0.25:5432/demo
Done.

[]

In [16]:
%%sql
INSERT INTO Employee (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID) VALUES
(100, 'Steven', 'King', '1987-06-17', 'AD_PRES', NULL, 90),
(101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-21', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-22', 'FI_MGR', 101, 100),
(109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-06-24', 'PU_MAN', 100, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(119, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 30),
(134, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);

 * postgresql://reader:***@10.129.0.25:5432/demo
12 rows affected.

[]

In [18]:
%%sql
SELECT 
    D.DEPARTMENT_NAME AS "Department Name",
    CONCAT(E.FIRST_NAME, ' ', E.LAST_NAME) AS "Manager Name",
    COUNT(EMP.EMPLOYEE_ID) AS "Number of Employees"
FROM 
    Departments D
JOIN 
    Employees E ON D.MANAGER_ID = E.EMPLOYEE_ID
LEFT JOIN 
    Employees EMP ON D.DEPARTMENT_ID = EMP.DEPARTMENT_ID
GROUP BY 
    D.DEPARTMENT_NAME, E.FIRST_NAME, E.LAST_NAME
ORDER BY 
    D.DEPARTMENT_NAME;

 * postgresql://reader:***@10.129.0.25:5432/demo
4 rows affected.

[('Executive', 'Steven King', 3),
 ('Finance', 'Nancy Greenberg', 2),
 ('IT', 'Alexander Hunold', 2),
 ('Purchasing', 'Den Raphaely', 3)]